std-study/option.org
#+TITLE: Option
#+AUTHOR: Typas Liao

[[https://github.com/rust-lang/rust/blob/master/library/core/src/option.rs][Source Code Location]]

* Use
#+BEGIN_SRC rust
use core::iter::{FromIterator, FusedIterator, TrustedLen};
use core::pin::Pin;
use core::{
    convert, fmt, hint, mem,
    ops::{self, Deref, DerefMut},
};
#+END_SRC

下方到時看看有什麼有使用到的。

* Definition
#+BEGIN_SRC rust
#[derive(Copy, PartialEq, PartialOrd, Eq, Ord, Debug, Hash)]
pub enum Option<T> {
    /// No value
    None,
    /// Some value `T`
    Some(T),
}
#+END_SRC

在去除一些給編譯器看的屬性巨集後，是非常簡單的定義。

* Associated Functions

* Const Methods

** Stable, but unstable const, issue 67441

*** is_some
#+BEGIN_SRC rust
#[inline]
pub const fn is_some(&self) -> bool {
    matches!(*self, Some(_))
}
#+END_SRC

用到了 [[https://doc.rust-lang.org/std/macro.matches.html][matches]] 巨集，在對應到任何有值的東西時回傳 =true= ，反之則回傳 =false= 。

*** is_none
#+BEGIN_SRC rust
#[inline]
pub const fn is_none(&self) -> bool {
    !self.is_some()
}
#+END_SRC

上面的 =is_some= [[*is_some][is_some]] 的反轉，只是我不太能理解為什麼是用 =Some= 而不是 =None= 去對應。

*** unwrap
#+BEGIN_SRC rust
#[inline]
#[track_caller]
pub const fn unwrap(self) -> T {
    match self {
        Some(val) => val,
        None => panic!("called `Option::unwrap()` on a `None` value"),
    }
}
#+END_SRC

就是一個在 =None= 會噴死你的函數，會拿走所有權。

*** iter
#+BEGIN_SRC rust
#[inline]
pub const fn iter(&self) -> Iter<'_, T> {
    Iter { inner: Item { opt: self.as_ref() } }
}
#+END_SRC

回傳的型態 [[*Iter][Iter]] 是模組內定義的一個結構。



* Safe Methods

** Stable

*** as_ref
#+BEGIN_SRC rust
#[inline]
pub const fn as_ref(&self) -> Option<&T> {
    match *self {
        Some(ref x) => Some(x),
        None => None,
    }
}
#+END_SRC

用到了 =match= 裡的 =ref= 關鍵字，配對的值本身型態是 =U= 時，加上 =ref= 則在分支內的變數 =x= 會是 =&U= 型態。

