std-study/option.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-11 五 13:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Option</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Typas Liao" />
</head>
<body>
<div id="content">
<h1 class="title">Option</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org56f1c12">1. Use</a></li>
<li><a href="#org296b252">2. Definition</a></li>
<li><a href="#orgb994a63">3. Associated Functions</a></li>
<li><a href="#org3a71852">4. Const Methods</a>
<ul>
<li><a href="#org188506a">4.1. Stable, but unstable const, issue 67441</a>
<ul>
<li><a href="#org6d28de4">4.1.1. is<sub>some</sub></a></li>
<li><a href="#org12c0d69">4.1.2. is<sub>none</sub></a></li>
<li><a href="#org11e233e">4.1.3. unwrap</a></li>
<li><a href="#org83207e2">4.1.4. iter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd775ec2">5. Safe Methods</a>
<ul>
<li><a href="#orgeedf899">5.1. Stable</a>
<ul>
<li><a href="#org61d9605">5.1.1. as<sub>ref</sub></a></li>
<li><a href="#org6ae33b5">5.1.2. as<sub>mut</sub></a></li>
<li><a href="#org7df8bff">5.1.3. as<sub>pin</sub><sub>ref</sub></a></li>
<li><a href="#org0187a85">5.1.4. as<sub>pin</sub><sub>mut</sub></a></li>
<li><a href="#org4efc9b7">5.1.5. expect</a></li>
<li><a href="#org1b158be">5.1.6. expect<sub>failed</sub></a></li>
<li><a href="#orgfbcd0e4">5.1.7. unwrap<sub>or</sub></a></li>
<li><a href="#org9062abe">5.1.8. unwrap<sub>or</sub><sub>else</sub></a></li>
<li><a href="#org4d56688">5.1.9. map</a></li>
<li><a href="#org371ef28">5.1.10. map<sub>or</sub></a></li>
<li><a href="#orgbd3eea3">5.1.11. map<sub>or</sub><sub>else</sub></a></li>
<li><a href="#org3a34481">5.1.12. ok<sub>or</sub></a></li>
<li><a href="#org1aec8c6">5.1.13. ok<sub>or</sub><sub>else</sub></a></li>
<li><a href="#orge14f0b7">5.1.14. iter<sub>mut</sub></a></li>
</ul>
</li>
<li><a href="#orgf8464a8">5.2. Unstable</a>
<ul>
<li><a href="#orgda5461d">5.2.1. contains</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb268af8">6. Unsafe Methods</a></li>
<li><a href="#org0dd7f7e">7. Trait Implementations</a></li>
<li><a href="#org22fbe3f">8. Structs</a>
<ul>
<li><a href="#org4a9bf6b">8.1. Item</a>
<ul>
<li><a href="#org7c80cef">8.1.1. Definition</a></li>
<li><a href="#orgfcda4cc">8.1.2. Trait Implementations</a></li>
</ul>
</li>
<li><a href="#org1d0ee06">8.2. Iter</a>
<ul>
<li><a href="#org4a9b51d">8.2.1. Definition</a></li>
<li><a href="#org0f81eef">8.2.2. Trait Implementations</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://github.com/rust-lang/rust/blob/master/library/core/src/option.rs">Source Code Location</a>
</p>

<div id="outline-container-org56f1c12" class="outline-2">
<h2 id="org56f1c12"><span class="section-number-2">1</span> Use</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #99cc99;">use</span> <span style="color: #6699cc;">core</span>::<span style="color: #6699cc;">iter</span>::<span style="color: #cccccc;">{</span><span style="color: #6699cc;">FromIterator</span>, <span style="color: #6699cc;">FusedIterator</span>, <span style="color: #6699cc;">TrustedLen</span><span style="color: #cccccc;">}</span>;
<span style="color: #99cc99;">use</span> <span style="color: #6699cc;">core</span>::<span style="color: #6699cc;">pin</span>::<span style="color: #6699cc;">Pin</span>;
<span style="color: #99cc99;">use</span> <span style="color: #6699cc;">core</span>::<span style="color: #cccccc;">{</span>
    convert, fmt, hint, mem,
    <span style="color: #6699cc;">ops</span>::<span style="color: #66cccc;">{</span><span style="color: #99cc99;">self</span>, <span style="color: #6699cc;">Deref</span>, <span style="color: #6699cc;">DerefMut</span><span style="color: #66cccc;">}</span>,
<span style="color: #cccccc;">}</span>;
</pre>
</div>

<p>
下方到時看看有什麼有使用到的。
</p>
</div>
</div>

<div id="outline-container-org296b252" class="outline-2">
<h2 id="org296b252"><span class="section-number-2">2</span> Definition</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">derive</span><span style="color: #66cccc;">(</span><span style="color: #cc99cc;">Copy, PartialEq, PartialOrd, Eq, Ord, Debug, Hash</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">enum</span> <span style="color: #6699cc;">Option</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">T</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #cc99cc;">/// No value</span>
    <span style="color: #6699cc;">None</span>,
    <span style="color: #cc99cc;">/// Some value `T`</span>
    <span style="color: #6699cc;">Some</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">T</span><span style="color: #66cccc;">)</span>,
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
在去除一些給編譯器看的屬性巨集後，是非常簡單的定義。
</p>
</div>
</div>

<div id="outline-container-orgb994a63" class="outline-2">
<h2 id="orgb994a63"><span class="section-number-2">3</span> Associated Functions</h2>
</div>

<div id="outline-container-org3a71852" class="outline-2">
<h2 id="org3a71852"><span class="section-number-2">4</span> Const Methods</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org188506a" class="outline-3">
<h3 id="org188506a"><span class="section-number-3">4.1</span> Stable, but unstable const, issue 67441</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org6d28de4" class="outline-4">
<h4 id="org6d28de4"><span class="section-number-4">4.1.1</span> is<sub>some</sub></h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">const</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">is_some</span><span style="color: #cccccc;">(</span>&amp;<span style="color: #99cc99;">self</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">bool</span> <span style="color: #cccccc;">{</span>
    <span style="color: #cc99cc;">matches!</span><span style="color: #66cccc;">(</span>*<span style="color: #99cc99;">self</span>, <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>_<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
用到了 <a href="https://doc.rust-lang.org/std/macro.matches.html">matches</a> 巨集，在對應到任何有值的東西時回傳 <code>true</code> ，反之則回傳 <code>false</code> 。
</p>
</div>
</div>

<div id="outline-container-org12c0d69" class="outline-4">
<h4 id="org12c0d69"><span class="section-number-4">4.1.2</span> is<sub>none</sub></h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">const</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">is_none</span><span style="color: #cccccc;">(</span>&amp;<span style="color: #99cc99;">self</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">bool</span> <span style="color: #cccccc;">{</span>
    !<span style="color: #99cc99;">self</span>.is_some<span style="color: #66cccc;">()</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
上面的 <code>is_some</code> <a href="#org6d28de4">is<sub>some</sub></a> 的反轉，只是我不太能理解為什麼是用 <code>Some</code> 而不是 <code>None</code> 去對應。
</p>
</div>
</div>

<div id="outline-container-org11e233e" class="outline-4">
<h4 id="org11e233e"><span class="section-number-4">4.1.3</span> unwrap</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">track_caller</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">const</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">unwrap</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">self</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">T</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>val<span style="color: #ffcc66;">)</span> =&gt; val,
        <span style="color: #6699cc;">None</span> =&gt; <span style="color: #cc99cc;">panic!</span><span style="color: #ffcc66;">(</span><span style="color: #66cccc;">"called `Option::unwrap()` on a `None` value"</span><span style="color: #ffcc66;">)</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
就是一個在 <code>None</code> 會噴死你的函數，會拿走所有權。
</p>
</div>
</div>

<div id="outline-container-org83207e2" class="outline-4">
<h4 id="org83207e2"><span class="section-number-4">4.1.4</span> iter</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
<a id="org99114b8"></a>
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">const</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">iter</span><span style="color: #cccccc;">(</span>&amp;<span style="color: #99cc99;">self</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Iter</span><span style="color: #cccccc;">&lt;</span>'<span style="color: #ffcc66;">_</span>, <span style="color: #6699cc;">T</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #6699cc;">Iter</span> <span style="color: #66cccc;">{</span> <span style="color: #ffcc66;">inner</span>: <span style="color: #6699cc;">Item</span> <span style="color: #ffcc66;">{</span> <span style="color: #ffcc66;">opt</span>: <span style="color: #99cc99;">self</span>.as_ref<span style="color: #cccccc;">()</span> <span style="color: #ffcc66;">}</span> <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
回傳的型態 <a href="#org2eb0c8d">Iter</a> 是模組內定義的一個結構。
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-orgd775ec2" class="outline-2">
<h2 id="orgd775ec2"><span class="section-number-2">5</span> Safe Methods</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgeedf899" class="outline-3">
<h3 id="orgeedf899"><span class="section-number-3">5.1</span> Stable</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org61d9605" class="outline-4">
<h4 id="org61d9605"><span class="section-number-4">5.1.1</span> as<sub>ref</sub></h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">const</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">as_ref</span><span style="color: #cccccc;">(</span>&amp;<span style="color: #99cc99;">self</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Option</span><span style="color: #cccccc;">&lt;</span>&amp;<span style="color: #6699cc;">T</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> *<span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span><span style="color: #99cc99;">ref</span> <span style="color: #ffcc66;">x</span><span style="color: #ffcc66;">)</span> =&gt; <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>x<span style="color: #ffcc66;">)</span>,
        <span style="color: #6699cc;">None</span> =&gt; <span style="color: #6699cc;">None</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
用到了 <code>match</code> 裡的 <code>ref</code> 關鍵字，配對的值本身型態是 <code>U</code> 時，加上 <code>ref</code> 則在分支內的變數 <code>x</code> 會是 <code>&amp;U</code> 型態。
</p>
</div>
</div>
