std-study/option.org
*** as_mut
#+BEGIN_SRC rust
#[inline]
pub fn as_mut(&mut self) -> Option<&mut T> {
    match *self {
        Some(ref mut x) => Some(x),
        None => None,
    }
}
#+END_SRC

同上，多用了一個 =mut= 關鍵字，型態改變成 =&mut U= 。

*** as_pin_ref
#+BEGIN_SRC rust
#[inline]
pub fn as_pin_ref(self: Pin<&Self>) -> Option<Pin<&T>> {
    // SAFETY: `x` is guaranteed to be pinned because it comes from `self`
    // which is pinned.
    unsafe { Pin::get_ref(self).as_ref().map(|x| Pin::new_unchecked(x)) }
}
#+END_SRC

TODO: usage of =core::pin::Pin=

*** as_pin_mut
#+BEGIN_SRC rust
#[inline]
pub fn as_pin_mut(self: Pin<&mut Self>) -> Option<Pin<&mut T>> {
    // SAFETY: `get_unchecked_mut` is never used to move the `Option` inside `self`.
    // `x` is guaranteed to be pinned because it comes from `self` which is pinned.
    unsafe { Pin::get_unchecked_mut(self).as_mut().map(|x| Pin::new_unchecked(x)) }
}
#+END_SRC

TODO: usage of =core::pin::Pin=

*** expect
#+BEGIN_SRC rust
#[inline]
#[track_caller]
pub fn expect(self, msg: &str) -> T {
    match self {
        Some(val) => val,
        None => expect_failed(msg),
    }
}
#+END_SRC

裡面的 =expect_failed()= 是私有方法，在對應到 =None= 時會觸發。會拿走所有權。

*** expect_failed
#+BEGIN_SRC rust
#[inline(never)]
#[cold]
#[track_caller]
fn expect_failed(msg: &str) -> ! {
    panic!("{}", msg)
}
#+END_SRC

屬性巨集 =cold= 是對編譯器提示這個函數不太可能被呼叫到。問題：為何會需要獨立成一個方法？

*** unwrap_or
#+BEGIN_SRC rust
#[inline]
pub fn unwrap_or(self, default: T) -> T {
    match self {
        Some(x) => x,
        None => default,
    }
}
#+END_SRC

請注意這裡會拿走自身與 =default= 的所有權。

*** unwrap_or_else
#+BEGIN_SRC rust
#[inline]
pub fn unwrap_or_else<F: FnOnce() -> T>(self, f: F) -> T {
    match self {
        Some(x) => x,
        None => f(),
    }
}
#+END_SRC

裡面的函數 f 會拿走所有內部變數的所有權，自身的所有權也會被此方法拿走。

