std-study/option.html

<div id="outline-container-org6ae33b5" class="outline-4">
<h4 id="org6ae33b5"><span class="section-number-4">5.1.2</span> as<sub>mut</sub></h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">as_mut</span><span style="color: #cccccc;">(</span>&amp;<span style="color: #99cc99;">mut</span> <span style="color: #99cc99;">self</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Option</span><span style="color: #cccccc;">&lt;</span>&amp;<span style="color: #99cc99;">mut</span> <span style="color: #6699cc;">T</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> *<span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span><span style="color: #99cc99;">ref</span> <span style="color: #99cc99;">mut</span> <span style="color: #ffcc66;">x</span><span style="color: #ffcc66;">)</span> =&gt; <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>x<span style="color: #ffcc66;">)</span>,
        <span style="color: #6699cc;">None</span> =&gt; <span style="color: #6699cc;">None</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
同上，多用了一個 <code>mut</code> 關鍵字，型態改變成 <code>&amp;mut U</code> 。
</p>
</div>
</div>

<div id="outline-container-org7df8bff" class="outline-4">
<h4 id="org7df8bff"><span class="section-number-4">5.1.3</span> as<sub>pin</sub><sub>ref</sub></h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">as_pin_ref</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">self</span>: <span style="color: #6699cc;">Pin</span><span style="color: #66cccc;">&lt;</span>&amp;<span style="color: #6699cc;">Self</span><span style="color: #66cccc;">&gt;</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Option</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">Pin</span><span style="color: #66cccc;">&lt;</span>&amp;<span style="color: #6699cc;">T</span><span style="color: #66cccc;">&gt;</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">SAFETY: `x` is guaranteed to be pinned because it comes from `self`</span>
    <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">which is pinned.</span>
    <span style="color: #f2777a; font-weight: bold;">unsafe</span> <span style="color: #66cccc;">{</span> <span style="color: #6699cc;">Pin</span>::get_ref<span style="color: #ffcc66;">(</span><span style="color: #99cc99;">self</span><span style="color: #ffcc66;">)</span>.as_ref<span style="color: #ffcc66;">()</span>.map<span style="color: #ffcc66;">(</span>|x| <span style="color: #6699cc;">Pin</span>::new_unchecked<span style="color: #cccccc;">(</span>x<span style="color: #cccccc;">)</span><span style="color: #ffcc66;">)</span> <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
TODO: usage of <code>core::pin::Pin</code>
</p>
</div>
</div>

<div id="outline-container-org0187a85" class="outline-4">
<h4 id="org0187a85"><span class="section-number-4">5.1.4</span> as<sub>pin</sub><sub>mut</sub></h4>
<div class="outline-text-4" id="text-5-1-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">as_pin_mut</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">self</span>: <span style="color: #6699cc;">Pin</span><span style="color: #66cccc;">&lt;</span>&amp;<span style="color: #99cc99;">mut</span> <span style="color: #6699cc;">Self</span><span style="color: #66cccc;">&gt;</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Option</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">Pin</span><span style="color: #66cccc;">&lt;</span>&amp;<span style="color: #99cc99;">mut</span> <span style="color: #6699cc;">T</span><span style="color: #66cccc;">&gt;</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">SAFETY: `get_unchecked_mut` is never used to move the `Option` inside `self`.</span>
    <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">`x` is guaranteed to be pinned because it comes from `self` which is pinned.</span>
    <span style="color: #f2777a; font-weight: bold;">unsafe</span> <span style="color: #66cccc;">{</span> <span style="color: #6699cc;">Pin</span>::get_unchecked_mut<span style="color: #ffcc66;">(</span><span style="color: #99cc99;">self</span><span style="color: #ffcc66;">)</span>.as_mut<span style="color: #ffcc66;">()</span>.map<span style="color: #ffcc66;">(</span>|x| <span style="color: #6699cc;">Pin</span>::new_unchecked<span style="color: #cccccc;">(</span>x<span style="color: #cccccc;">)</span><span style="color: #ffcc66;">)</span> <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
TODO: usage of <code>core::pin::Pin</code>
</p>
</div>
</div>

<div id="outline-container-org4efc9b7" class="outline-4">
<h4 id="org4efc9b7"><span class="section-number-4">5.1.5</span> expect</h4>
<div class="outline-text-4" id="text-5-1-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">track_caller</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">expect</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">msg</span>: &amp;<span style="color: #6699cc;">str</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">T</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>val<span style="color: #ffcc66;">)</span> =&gt; val,
        <span style="color: #6699cc;">None</span> =&gt; expect_failed<span style="color: #ffcc66;">(</span>msg<span style="color: #ffcc66;">)</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
裡面的 <code>expect_failed()</code> 是私有方法，在對應到 <code>None</code> 時會觸發。會拿走所有權。
</p>
</div>
</div>

<div id="outline-container-org1b158be" class="outline-4">
<h4 id="org1b158be"><span class="section-number-4">5.1.6</span> expect<sub>failed</sub></h4>
<div class="outline-text-4" id="text-5-1-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #66cccc;">(</span><span style="color: #cc99cc;">never</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">]</span>
<span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">cold</span><span style="color: #cccccc;">]</span>
<span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">track_caller</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">fn</span> <span style="color: #f99157;">expect_failed</span><span style="color: #cccccc;">(</span><span style="color: #ffcc66;">msg</span>: &amp;<span style="color: #6699cc;">str</span><span style="color: #cccccc;">)</span> -&gt; ! <span style="color: #cccccc;">{</span>
    <span style="color: #cc99cc;">panic!</span><span style="color: #66cccc;">(</span><span style="color: #66cccc;">"{}"</span>, msg<span style="color: #66cccc;">)</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
屬性巨集 <code>cold</code> 是對編譯器提示這個函數不太可能被呼叫到。問題：為何會需要獨立成一個方法？
</p>
</div>
</div>

<div id="outline-container-orgfbcd0e4" class="outline-4">
<h4 id="orgfbcd0e4"><span class="section-number-4">5.1.7</span> unwrap<sub>or</sub></h4>
<div class="outline-text-4" id="text-5-1-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">unwrap_or</span><span style="color: #cccccc;">(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">default</span>: <span style="color: #6699cc;">T</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">T</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>x<span style="color: #ffcc66;">)</span> =&gt; x,
        <span style="color: #6699cc;">None</span> =&gt; default,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
請注意這裡會拿走自身與 <code>default</code> 的所有權。
</p>
</div>
</div>

<div id="outline-container-org9062abe" class="outline-4">
<h4 id="org9062abe"><span class="section-number-4">5.1.8</span> unwrap<sub>or</sub><sub>else</sub></h4>
<div class="outline-text-4" id="text-5-1-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">unwrap_or_else</span><span style="color: #cccccc;">&lt;</span><span style="color: #ffcc66;">F</span>: <span style="color: #6699cc;">FnOnce</span><span style="color: #66cccc;">()</span> -&gt; <span style="color: #6699cc;">T</span><span style="color: #cccccc;">&gt;(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">f</span>: <span style="color: #6699cc;">F</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">T</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>x<span style="color: #ffcc66;">)</span> =&gt; x,
        <span style="color: #6699cc;">None</span> =&gt; f<span style="color: #ffcc66;">()</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
裡面的函數 f 會拿走所有內部變數的所有權，自身的所有權也會被此方法拿走。
</p>
</div>
</div>
