std-study/option.org
*** map
#+BEGIN_SRC rust
#[inline]
#[stable(feature = "rust1", since = "1.0.0")]
pub fn map<U, F: FnOnce(T) -> U>(self, f: F) -> Option<U> {
    match self {
        Some(x) => Some(f(x)),
        None => None,
    }
}
#+END_SRC

利用 f 將自身映射到 f(x) 上，此方法會拿走自身的所有權。

*** map_or
#+BEGIN_SRC rust
#[inline]
pub fn map_or<U, F: FnOnce(T) -> U>(self, default: U, f: F) -> U {
    match self {
        Some(t) => f(t),
        None => default,
    }
}
#+END_SRC

與 =unwrap_or= 相似，但 =default= 的型態為映射後的 =U= 而非原來的 =T= 。

*** map_or_else
#+BEGIN_SRC rust
#[inline]
pub fn map_or_else<U, D: FnOnce() -> U, F: FnOnce(T) -> U>(self, default: D, f: F) -> U {
    match self {
        Some(t) => f(t),
        None => default(),
    }
}
#+END_SRC

與 =unwrap_or_else= 相似，但型態為映射後的 =U= 。

*** ok_or
#+BEGIN_SRC rust
#[inline]
pub fn ok_or<E>(self, err: E) -> Result<T, E> {
    match self {
        Some(v) => Ok(v),
        None => Err(err),
    }
}
#+END_SRC

把 =Option<T>= 型態轉成 =Result<T, E>= 型態的神方法，需要自行加上錯誤型態，兩個參數都會被拿走所有權。

*** ok_or_else
#+BEGIN_SRC rust
#[inline]
pub fn ok_or_else<E, F: FnOnce() -> E>(self, err: F) -> Result<T, E> {
    match self {
        Some(v) => Ok(v),
        None => Err(err()),
    }
}
#+END_SRC

=ok_or= 的錯誤參數改成使用一個回傳錯誤的函數。會拿走自身的所有權。

*** iter_mut

** Unstable

*** contains
#+BEGIN_SRC rust
#[inline]
#[unstable(feature = "option_result_contains", issue = "62358")]
pub fn contains<U>(&self, x: &U) -> bool
where
    U: PartialEq<T>,
{
    match self {
        Some(y) => x == y,
        None => false,
    }
}
#+END_SRC

從定義看出，這段程式碼在使用了特徵綁定後不需限於同型態，只需要單向的PartialEq特徵即可。

* Unsafe Methods

* Trait Implementations

* Structs

** Item

