std-study/option.html

<div id="outline-container-org4d56688" class="outline-4">
<h4 id="org4d56688"><span class="section-number-4">5.1.9</span> map</h4>
<div class="outline-text-4" id="text-5-1-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">stable</span><span style="color: #66cccc;">(</span><span style="color: #cc99cc;">feature = </span><span style="color: #66cccc;">"rust1"</span><span style="color: #cc99cc;">, since = </span><span style="color: #66cccc;">"1.0.0"</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">map</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">U</span>, <span style="color: #ffcc66;">F</span>: <span style="color: #6699cc;">FnOnce</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">T</span><span style="color: #66cccc;">)</span> -&gt; <span style="color: #6699cc;">U</span><span style="color: #cccccc;">&gt;(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">f</span>: <span style="color: #6699cc;">F</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Option</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">U</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>x<span style="color: #ffcc66;">)</span> =&gt; <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>f<span style="color: #cccccc;">(</span>x<span style="color: #cccccc;">)</span><span style="color: #ffcc66;">)</span>,
        <span style="color: #6699cc;">None</span> =&gt; <span style="color: #6699cc;">None</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
利用 f 將自身映射到 f(x) 上，此方法會拿走自身的所有權。
</p>
</div>
</div>

<div id="outline-container-org371ef28" class="outline-4">
<h4 id="org371ef28"><span class="section-number-4">5.1.10</span> map<sub>or</sub></h4>
<div class="outline-text-4" id="text-5-1-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">map_or</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">U</span>, <span style="color: #ffcc66;">F</span>: <span style="color: #6699cc;">FnOnce</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">T</span><span style="color: #66cccc;">)</span> -&gt; <span style="color: #6699cc;">U</span><span style="color: #cccccc;">&gt;(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">default</span>: <span style="color: #6699cc;">U</span>, <span style="color: #ffcc66;">f</span>: <span style="color: #6699cc;">F</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">U</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>t<span style="color: #ffcc66;">)</span> =&gt; f<span style="color: #ffcc66;">(</span>t<span style="color: #ffcc66;">)</span>,
        <span style="color: #6699cc;">None</span> =&gt; default,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
與 <code>unwrap_or</code> 相似，但 <code>default</code> 的型態為映射後的 <code>U</code> 而非原來的 <code>T</code> 。
</p>
</div>
</div>

<div id="outline-container-orgbd3eea3" class="outline-4">
<h4 id="orgbd3eea3"><span class="section-number-4">5.1.11</span> map<sub>or</sub><sub>else</sub></h4>
<div class="outline-text-4" id="text-5-1-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">map_or_else</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">U</span>, <span style="color: #ffcc66;">D</span>: <span style="color: #6699cc;">FnOnce</span><span style="color: #66cccc;">()</span> -&gt; <span style="color: #6699cc;">U</span>, <span style="color: #ffcc66;">F</span>: <span style="color: #6699cc;">FnOnce</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">T</span><span style="color: #66cccc;">)</span> -&gt; <span style="color: #6699cc;">U</span><span style="color: #cccccc;">&gt;(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">default</span>: <span style="color: #6699cc;">D</span>, <span style="color: #ffcc66;">f</span>: <span style="color: #6699cc;">F</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">U</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>t<span style="color: #ffcc66;">)</span> =&gt; f<span style="color: #ffcc66;">(</span>t<span style="color: #ffcc66;">)</span>,
        <span style="color: #6699cc;">None</span> =&gt; default<span style="color: #ffcc66;">()</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
與 <code>unwrap_or_else</code> 相似，但型態為映射後的 <code>U</code> 。
</p>
</div>
</div>

<div id="outline-container-org3a34481" class="outline-4">
<h4 id="org3a34481"><span class="section-number-4">5.1.12</span> ok<sub>or</sub></h4>
<div class="outline-text-4" id="text-5-1-12">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">ok_or</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">E</span><span style="color: #cccccc;">&gt;(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">err</span>: <span style="color: #6699cc;">E</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Result</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">T</span>, <span style="color: #6699cc;">E</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>v<span style="color: #ffcc66;">)</span> =&gt; <span style="color: #6699cc;">Ok</span><span style="color: #ffcc66;">(</span>v<span style="color: #ffcc66;">)</span>,
        <span style="color: #6699cc;">None</span> =&gt; <span style="color: #6699cc;">Err</span><span style="color: #ffcc66;">(</span>err<span style="color: #ffcc66;">)</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
把 <code>Option&lt;T&gt;</code> 型態轉成 <code>Result&lt;T, E&gt;</code> 型態的神方法，需要自行加上錯誤型態，兩個參數都會被拿走所有權。
</p>
</div>
</div>

<div id="outline-container-org1aec8c6" class="outline-4">
<h4 id="org1aec8c6"><span class="section-number-4">5.1.13</span> ok<sub>or</sub><sub>else</sub></h4>
<div class="outline-text-4" id="text-5-1-13">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">ok_or_else</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">E</span>, <span style="color: #ffcc66;">F</span>: <span style="color: #6699cc;">FnOnce</span><span style="color: #66cccc;">()</span> -&gt; <span style="color: #6699cc;">E</span><span style="color: #cccccc;">&gt;(</span><span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">err</span>: <span style="color: #6699cc;">F</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">Result</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">T</span>, <span style="color: #6699cc;">E</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>v<span style="color: #ffcc66;">)</span> =&gt; <span style="color: #6699cc;">Ok</span><span style="color: #ffcc66;">(</span>v<span style="color: #ffcc66;">)</span>,
        <span style="color: #6699cc;">None</span> =&gt; <span style="color: #6699cc;">Err</span><span style="color: #ffcc66;">(</span>err<span style="color: #cccccc;">()</span><span style="color: #ffcc66;">)</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
<code>ok_or</code> 的錯誤參數改成使用一個回傳錯誤的函數。會拿走自身的所有權。
</p>
</div>
</div>

<div id="outline-container-orge14f0b7" class="outline-4">
<h4 id="orge14f0b7"><span class="section-number-4">5.1.14</span> iter<sub>mut</sub></h4>
</div>
</div>

<div id="outline-container-orgf8464a8" class="outline-3">
<h3 id="orgf8464a8"><span class="section-number-3">5.2</span> Unstable</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgda5461d" class="outline-4">
<h4 id="orgda5461d"><span class="section-number-4">5.2.1</span> contains</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #cccccc;">]</span>
<span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">unstable</span><span style="color: #66cccc;">(</span><span style="color: #cc99cc;">feature = </span><span style="color: #66cccc;">"option_result_contains"</span><span style="color: #cc99cc;">, issue = </span><span style="color: #66cccc;">"62358"</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">contains</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">U</span><span style="color: #cccccc;">&gt;(</span>&amp;<span style="color: #99cc99;">self</span>, <span style="color: #ffcc66;">x</span>: &amp;<span style="color: #6699cc;">U</span><span style="color: #cccccc;">)</span> -&gt; <span style="color: #6699cc;">bool</span>
<span style="color: #99cc99;">where</span>
    <span style="color: #ffcc66;">U</span>: <span style="color: #6699cc;">PartialEq</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">T</span><span style="color: #cccccc;">&gt;</span>,
<span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span> <span style="color: #66cccc;">{</span>
        <span style="color: #6699cc;">Some</span><span style="color: #ffcc66;">(</span>y<span style="color: #ffcc66;">)</span> =&gt; x == y,
        <span style="color: #6699cc;">None</span> =&gt; <span style="color: #99cc99;">false</span>,
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>

<p>
從定義看出，這段程式碼在使用了特徵綁定後不需限於同型態，只需要單向的PartialEq特徵即可。
</p>
</div>
</div>
</div>
</div>
