std-study/option.org
*** Definition
#+BEGIN_SRC rust
#[derive(Clone, Debug)]
struct Item<A> {
    opt: Option<A>,
}
#+END_SRC



*** Trait Implementations

**** Iterator
#+BEGIN_SRC rust
impl<A> Iterator for Item<A> {
    type Item = A;

    #[inline]
    fn next(&mut self) -> Option<A> {
        self.opt.take()
    }

    #[inline]
    fn size_hint(&self) -> (usize, Option<usize>) {
        match self.opt {
            Some(_) => (1, Some(1)),
            None => (0, Some(0)),
        }
    }
}
#+END_SRC

**** DoubleEndedIterator
#+BEGIN_SRC rust
impl<A> DoubleEndedIterator for Item<A> {
    #[inline]
    fn next_back(&mut self) -> Option<A> {
        self.opt.take()
    }
}
#+END_SRC

**** ExactSizeIterator
#+BEGIN_SRC rust
impl<A> ExactSizeIterator for Item<A> {}
#+END_SRC

**** FusedIterator
#+BEGIN_SRC rust
impl<A> FusedIterator for Item<A> {}
#+END_SRC

**** TrustedLen
#+BEGIN_SRC rust
unsafe impl<A> TrustedLen for Item<A> {}
#+END_SRC

** Iter

[[*iter][iter()]] [[*iter][iter()]] 所回傳的結構。

*** Definition
#+BEGIN_SRC rust
#[derive(Debug)]
pub struct Iter<'a, A: 'a> {
    inner: Item<&'a A>,
}
#+END_SRC


*** Trait Implementations
