std-study/option.html

<div id="outline-container-orgb268af8" class="outline-2">
<h2 id="orgb268af8"><span class="section-number-2">6</span> Unsafe Methods</h2>
</div>

<div id="outline-container-org0dd7f7e" class="outline-2">
<h2 id="org0dd7f7e"><span class="section-number-2">7</span> Trait Implementations</h2>
</div>

<div id="outline-container-org22fbe3f" class="outline-2">
<h2 id="org22fbe3f"><span class="section-number-2">8</span> Structs</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org4a9bf6b" class="outline-3">
<h3 id="org4a9bf6b"><span class="section-number-3">8.1</span> Item</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org7c80cef" class="outline-4">
<h4 id="org7c80cef"><span class="section-number-4">8.1.1</span> Definition</h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">derive</span><span style="color: #66cccc;">(</span><span style="color: #cc99cc;">Clone, Debug</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">Item</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #ffcc66;">opt</span>: <span style="color: #6699cc;">Option</span><span style="color: #66cccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #66cccc;">&gt;</span>,
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-orgfcda4cc" class="outline-4">
<h4 id="orgfcda4cc"><span class="section-number-4">8.1.2</span> Trait Implementations</h4>
<div class="outline-text-4" id="text-8-1-2">
</div>
<ol class="org-ol">
<li><a id="orged284cb"></a>Iterator<br />
<div class="outline-text-5" id="text-8-1-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #99cc99;">impl</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #6699cc;">Iterator</span> <span style="color: #99cc99;">for</span> <span style="color: #6699cc;">Item</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #99cc99;">type</span> <span style="color: #6699cc;">Item</span> = <span style="color: #6699cc;">A</span>;

    <span style="color: #cc99cc;">#</span><span style="color: #66cccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #66cccc;">]</span>
    <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">next</span><span style="color: #66cccc;">(</span>&amp;<span style="color: #99cc99;">mut</span> <span style="color: #99cc99;">self</span><span style="color: #66cccc;">)</span> -&gt; <span style="color: #6699cc;">Option</span><span style="color: #66cccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #66cccc;">&gt;</span> <span style="color: #66cccc;">{</span>
        <span style="color: #99cc99;">self</span>.opt.take<span style="color: #ffcc66;">()</span>
    <span style="color: #66cccc;">}</span>

    <span style="color: #cc99cc;">#</span><span style="color: #66cccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #66cccc;">]</span>
    <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">size_hint</span><span style="color: #66cccc;">(</span>&amp;<span style="color: #99cc99;">self</span><span style="color: #66cccc;">)</span> -&gt; <span style="color: #66cccc;">(</span><span style="color: #6699cc;">usize</span>, <span style="color: #6699cc;">Option</span><span style="color: #ffcc66;">&lt;</span><span style="color: #6699cc;">usize</span><span style="color: #ffcc66;">&gt;</span><span style="color: #66cccc;">)</span> <span style="color: #66cccc;">{</span>
        <span style="color: #99cc99;">match</span> <span style="color: #99cc99;">self</span>.opt <span style="color: #ffcc66;">{</span>
            <span style="color: #6699cc;">Some</span><span style="color: #cccccc;">(</span>_<span style="color: #cccccc;">)</span> =&gt; <span style="color: #cccccc;">(</span><span style="color: #6699cc;">1</span>, <span style="color: #6699cc;">Some</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">1</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>,
            <span style="color: #6699cc;">None</span> =&gt; <span style="color: #cccccc;">(</span><span style="color: #6699cc;">0</span>, <span style="color: #6699cc;">Some</span><span style="color: #66cccc;">(</span><span style="color: #6699cc;">0</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">)</span>,
        <span style="color: #ffcc66;">}</span>
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orga0e731a"></a>DoubleEndedIterator<br />
<div class="outline-text-5" id="text-8-1-2-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #99cc99;">impl</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #6699cc;">DoubleEndedIterator</span> <span style="color: #99cc99;">for</span> <span style="color: #6699cc;">Item</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #cc99cc;">#</span><span style="color: #66cccc;">[</span><span style="color: #cc99cc;">inline</span><span style="color: #66cccc;">]</span>
    <span style="color: #99cc99;">fn</span> <span style="color: #f99157;">next_back</span><span style="color: #66cccc;">(</span>&amp;<span style="color: #99cc99;">mut</span> <span style="color: #99cc99;">self</span><span style="color: #66cccc;">)</span> -&gt; <span style="color: #6699cc;">Option</span><span style="color: #66cccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #66cccc;">&gt;</span> <span style="color: #66cccc;">{</span>
        <span style="color: #99cc99;">self</span>.opt.take<span style="color: #ffcc66;">()</span>
    <span style="color: #66cccc;">}</span>
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org97f729d"></a>ExactSizeIterator<br />
<div class="outline-text-5" id="text-8-1-2-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #99cc99;">impl</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #6699cc;">ExactSizeIterator</span> <span style="color: #99cc99;">for</span> <span style="color: #6699cc;">Item</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{}</span>
</pre>
</div>
</div>
</li>

<li><a id="org06a4d37"></a>FusedIterator<br />
<div class="outline-text-5" id="text-8-1-2-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #99cc99;">impl</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #6699cc;">FusedIterator</span> <span style="color: #99cc99;">for</span> <span style="color: #6699cc;">Item</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{}</span>
</pre>
</div>
</div>
</li>

<li><a id="org3fa513d"></a>TrustedLen<br />
<div class="outline-text-5" id="text-8-1-2-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #f2777a; font-weight: bold;">unsafe</span> <span style="color: #99cc99;">impl</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #6699cc;">TrustedLen</span> <span style="color: #99cc99;">for</span> <span style="color: #6699cc;">Item</span><span style="color: #cccccc;">&lt;</span><span style="color: #6699cc;">A</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org1d0ee06" class="outline-3">
<h3 id="org1d0ee06"><span class="section-number-3">8.2</span> Iter</h3>
<div class="outline-text-3" id="text-8-2">
<p>
<a id="org2eb0c8d"></a>
</p>

<p>
<a href="#org99114b8">iter()</a> 所回傳的結構。
</p>
</div>

<div id="outline-container-org4a9b51d" class="outline-4">
<h4 id="org4a9b51d"><span class="section-number-4">8.2.1</span> Definition</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #cc99cc;">#</span><span style="color: #cccccc;">[</span><span style="color: #cc99cc;">derive</span><span style="color: #66cccc;">(</span><span style="color: #cc99cc;">Debug</span><span style="color: #66cccc;">)</span><span style="color: #cccccc;">]</span>
<span style="color: #99cc99;">pub</span> <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">Iter</span><span style="color: #cccccc;">&lt;</span>'<span style="color: #ffcc66;">a</span>, <span style="color: #ffcc66;">A</span>: '<span style="color: #ffcc66;">a</span><span style="color: #cccccc;">&gt;</span> <span style="color: #cccccc;">{</span>
    <span style="color: #ffcc66;">inner</span>: <span style="color: #6699cc;">Item</span><span style="color: #66cccc;">&lt;</span>&amp;'<span style="color: #ffcc66;">a</span> <span style="color: #6699cc;">A</span><span style="color: #66cccc;">&gt;</span>,
<span style="color: #cccccc;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org0f81eef" class="outline-4">
<h4 id="org0f81eef"><span class="section-number-4">8.2.2</span> Trait Implementations</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Typas Liao</p>
<p class="date">Created: 2020-09-11 五 13:11</p>
</div>
</body>
</html>
